XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/YTMicro.YTM32B1LE0_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.7.26" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.26/schema/PACK.xsd">
  <vendor>YTMicro</vendor>
  <name>YTM32B1LE0_DFP</name>
  <description>Device Family Pack for YTM32B1LE0</description>
  <url>https://doc.ytmicro.com/keil/</url>

  <releases>
    <release version="1.2.0" date="2024-03-12">
      Updated head and svd file.
    </release>
    <release version="1.1.1" date="2023-09-21">
      Updated devices.
    </release>
    <release version="1.1.0" date="2023-06-25">
      Changed company short form and Dvendor ID to 180.
      Fixed QFN featrue description.
    </release>
    <release version="1.0.3" date="2023-05-23"> 
      Added YTM32B1LE04 subFamily.
    </release>
    <release version="1.0.2" date="2023-03-13"> 
      Only include device info and flash download algorithm.
    </release>
    <release version="1.0.1" date="2023-02-17"> 
      Added ISELED device.
    </release>
    <release version="1.0.0" date="2022-10-17"> 
      Initial release.
    </release>
  </releases>

  <keywords>
    <keyword>YTMicro</keyword>
    <keyword>YTM32B1LE0</keyword>
    <keyword>Device Family Pack</keyword>
  </keywords>

  <devices>
    <family Dfamily="YTM32Bx" Dvendor="YTMicro:180">

      <!-- ******************************  Subfamily 'YTM32B1LE05'  ****************************** -->
      <subFamily DsubFamily="YTM32B1LE0">
        <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="48000000" /> 
        <compile header="Device/Include/YTM32B1LE0.h"/>
        <debug svd="SVD/YTM32B1LE0.svd"/>
        <algorithm name="Flash/YTM32B1LE0_Main.FLM" start="0x00000000" size="0x00020000" default="1"/>
        <algorithm name="Flash/YTM32B1LE0_Dflash.FLM" start="0x10000000" size="0x00000800" default="0"/>
        <memory name="IRAM1" access="rwx" start="0x20000000" size="0x4000" default="1"/>
        <memory name="IROM1" access="rx" start="0x00000000" size="0x20000" default="1"/>
        <memory name="IROM2" access="rx" start="0x10000000" size="0x800" default="1"/>
        <description>YTM32B1LE0 48MHz MCU based on ARM Cortex-M0+ Core.</description>

        <device Dname="YTM32B1LE05">
          <description>Includes LQFP64/48/32 and QFN32 packages. 128KB PFlash, 2KB DFlash, 16KB SRAM</description>
        </device>

        <device Dname="YTM32B1LE04">
          <description>Includes LQFP48/32 and QFN32 packages. 64KB PFlash, 2KB DFlash, 8KB SRAM</description>
        </device>
      </subFamily>
    </family>
  </devices>

  <taxonomy>
    <description Cclass="Device" Cgroup="Startup">YTMicro SDK Startup</description>
    <description Cclass="Device" Cgroup="SDK Drivers">YTMicro SDK Peripheral Drivers</description>
  </taxonomy>

  <conditions>
    <condition id="YTM32B1LE0">
      <description>YTMicro YTM32B1LE0x device</description>
      <require Dvendor="YTMicro:180" Dname="YTM32B1LE0*"/>
    </condition>

    <!-- Device + Compiler Conditions (GCC) -->
    <condition id="YTM32B1L_GCC">
      <description>YTMicro device and GCC compiler</description>
      <require Tcompiler="GCC"/>
    </condition>
  </conditions>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.1.1" condition="YTM32B1LE0">
      <description>Startup for MCU</description>
      <files>
        <file category="include" name="Device/Include/"/>
        <file category="source"  name="Device/Source/startup.c" attr="config" version="1.1.1"/>
        <file category="source"  name="Device/Source/system_YTM32B1LE0.c" attr="config" version="1.1.1"/>
        <file category="source"  condition="YTM32B1L_GCC" name="Device/Source/YTM32B1LE0_startup_gcc.S" attr="config" version="1.1.1"/>
      </files>
    </component>
  </components>
</package>
